tspl/cps-notes.org
#+TITLE:       CPS Lecture
#+AUTHOR:      Indiana course
#+MODIFIED:    Yali Bian


* Introduction

  No published books do this subject justice (including Dan's!)

  + Which part of (f (g (h i) j) k) can be done first? :: (h i), since it must be evaluated before (g (h i) j) can be applied.\\

  + What about (f (g (h i) (j k)))? :: Scheme doesn't specify the order in which arguments are evaluated so it could be either (h i) or (j k).\\

  + So, let's take control (h i (lambda (hi) ...)). :: We assume that hi is the result of applying (h i). Then, we drop in everything else that has to be done to replace the ...:

#+begin_src racket

(f (g (h i) (j l)))

#+end_src

  becomes

#+begin_src racket

(h i (lambda (hi) (f (g hi (j l)))))

#+end_src

  (lambda (hi) (f (g hi (j l)))) is a continuation. hi only appears once in the body of the continuation, because hi is intended to replace (h i) and only (h i).



* Implement

  Let's write rember in CPS. First, the direct style:

#+begin_src racket

; direct style
; remove the member 8 in the list
(define rember8
  (lambda (ls)
    (cond
      [(null? ls) '()]
      [(= (car ls) 8) (cdr ls)]
      [else (cons (car ls) (rember8 (cdr ls)))])))

#+end_src

** First rule

   *First rule: whenever we see a lambda in the code we want to CPS, we have to add an argument, and then process the body:*

   (lambda (x ...) ...) => (lambda (x ... k) ...^)

   Let's start by adding a k to the outer lambda:

#+begin_src racket

(define rember8
  (lambda (ls k)
    (cond
      [(null? ls) '()]
      [(= (car ls) 8) (cdr ls)]
      [else (cons (car ls) (rember8 (cdr ls)))])))

#+end_src

   Now, to handle the rest of the program, we have to introduce a new rule.

