tspl/cps-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CPS Lecture</title>
<!-- 2015-07-19 Sun 16:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Indiana course" />
</head>
<body>
<div id="content">
<h1 class="title">CPS Lecture</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Implement</a>
<ul>
<li><a href="#sec-2-1">2.1. First rule</a></li>
<li><a href="#sec-2-2">2.2. Second rule</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Property</a>
<ul>
<li><a href="#sec-3-1">3.1. Tail calls</a></li>
<li><a href="#sec-3-2">3.2. Arguments</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Demo</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
No published books do this subject justice (including Dan's!)
</p>

<dl class="org-dl">
<dt> Which part of (f (g (h i) j) k) can be done first? </dt><dd>(h i), since it must be evaluated before (g (h i) j) can be applied.<br  />
</dd>

<dt> What about (f (g (h i) (j k)))? </dt><dd>Scheme doesn't specify the order in which arguments are evaluated so it could be either (h i) or (j k).<br  />
</dd>

<dt> So, let's take control (h i (lambda (hi) &#x2026;)). </dt><dd>We assume that hi is the result of applying (h i). Then, we drop in everything else that has to be done to replace the &#x2026;:
</dd>
</dl>

<div class="org-src-container">

<pre class="src src-racket"><span style="color: #333333;">(</span>f <span style="color: #333333;">(</span>g <span style="color: #333333;">(</span>h i<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>j l<span style="color: #333333;">)))</span>
</pre>
</div>

<p>
becomes
</p>

<div class="org-src-container">

<pre class="src src-racket"><span style="color: #333333;">(</span>h i <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>hi<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>f <span style="color: #333333;">(</span>g hi <span style="color: #333333;">(</span>j l<span style="color: #333333;">)))))</span>
</pre>
</div>

<p>
(lambda (hi) (f (g hi (j l)))) is a continuation. hi only appears once in the body of the continuation, because hi is intended to replace (h i) and only (h i).
</p>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Implement</h2>
<div class="outline-text-2" id="text-2">
<p>
Let's write rember in CPS. First, the direct style:
</p>

<div class="org-src-container">

<pre class="src src-racket"><span style="color: #8D8D84;">; </span><span style="color: #8D8D84; font-style: italic;">direct style</span>
<span style="color: #8D8D84;">; </span><span style="color: #8D8D84; font-style: italic;">remove the member 8 in the list</span>
<span style="color: #333333;">(</span><span style="color: #0000FF;">define</span> <span style="color: #BA36A5;">rember8</span>
  <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>ls<span style="color: #333333;">)</span>
    <span style="color: #333333;">(</span><span style="color: #0000FF;">cond</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">null?</span> ls<span style="color: #333333;">)</span> '<span style="color: #333333;">()]</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">=</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #2e8b57;">8</span><span style="color: #333333;">)</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)]</span>
      <span style="color: #333333;">[</span>else <span style="color: #333333;">(</span><span style="color: #006FE0;">cons</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>rember8 <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)))])))</span>
</pre>
</div>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> First rule</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>First rule: whenever we see a lambda in the code we want to CPS, we have to add an argument, and then process the body:</b>
</p>

<p>
(lambda (x &#x2026;) &#x2026;) =&gt; (lambda (x &#x2026; k) &#x2026;^)
</p>

<p>
Let's start by adding a k to the outer lambda:
</p>

<div class="org-src-container">

<pre class="src src-racket"><span style="color: #333333;">(</span><span style="color: #0000FF;">define</span> <span style="color: #BA36A5;">rember8</span>
  <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>ls k<span style="color: #333333;">)</span>
    <span style="color: #333333;">(</span><span style="color: #0000FF;">cond</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">null?</span> ls<span style="color: #333333;">)</span> '<span style="color: #333333;">()]</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">=</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #2e8b57;">8</span><span style="color: #333333;">)</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)]</span>
      <span style="color: #333333;">[</span>else <span style="color: #333333;">(</span><span style="color: #006FE0;">cons</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>rember8 <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)))])))</span>
</pre>
</div>

<p>
Now, to handle the rest of the program, we have to introduce a new rule.
</p>
</div>
</div>
