tspl/cps-notes.org
** Second rule

   *Second rule: "Don't sweat the small stuff!".*

   + Small stuff is stuff we know will terminate right away.

   + Don't sweat the small stuff if we know it will be evaluated.

   + Don't sweat the small stuff if it *might* be evaluated, but instead pass it to k.


   A good example of the first is (null? ls) in the first cond line. We know it will be evaluated, and we know it's small stuff, so we don't have to worry about it. What about the '() that's returned as an answer? The other part of the second rule is that if some small stuff *might* be evaluated, we just pass it to k. After applying the second rule to the first cond line, we get:

#+begin_src racket

(define rember8
  (lambda (ls k)
    (cond
      [(null? ls) (k '())]
      [(= (car ls) 8) (cdr ls)]
      [else (cons (car ls) (rember8 (cdr ls)))])))

#+end_src

   The second cond line also has small stuff in both the test and the return value, so we can treat it just like the first line.

#+begin_src racket

(define rember8
  (lambda (ls k)
    (cond
      [(null? ls) (k '())]
      [(= (car ls) 8) (k (cdr ls))]
      [else (cons (car ls) (rember8 (cdr ls)))])))

#+end_src

   The else case, however, does *not* have small stuff as a return value, so we have to build a new continuation:

#+begin_src racket

(define rember8
  (lambda (ls k)
    (cond
      [(null? ls) (k '())]
      [(= (car ls) 8) (k (cdr ls))]
      [else (rember8 (cdr ls) (lambda (x) (cons (car ls) x)))])))

#+end_src

   We're not quite done, though, since we now have small stuff in the body of the continuation. So, we just pass it to k:

#+begin_src racket

(define rember8
  (lambda (ls k)
    (cond
      [(null? ls) (k '())]
      [(= (car ls) 8) (k (cdr ls))]
      [else (rember8 (cdr ls) (lambda (x) (k (cons (car ls) x))))])))

#+end_src

This is now completely CPSed, but how do we invoke it? After all, we need a k to pass in. Since (rember8 '() k) should be '(), k can be the identity function (lambda (x) x):

#+begin_src racket

> (rember8 '(1 2 8 3 4 6 7 8 5) (lambda (x) x))

#+end_src

* Property

  What properties can we observe about this program?

** Tail calls

  First, all non-small stuff calls are tail calls. Here's the program with the tail calls surrounded by asterisks:

#+begin_src racket

(define rember8
  (lambda (ls k)
    (cond
      [(null? ls) (*k* '())]
      [(= (car ls) 8) (*k* (cdr ls))]
      [else (*rember8* (cdr ls) (lambda (x) (*k* (cons (car ls) x))))])))

#+end_src

  Why don't null?, =, car, cdr, and cons count? Because they're just small stuff, and when we combine small stuff together in small ways, the combination remains small.

