tspl/cps-notes.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Second rule</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>Second rule: "Don't sweat the small stuff!".</b>
</p>

<ul class="org-ul">
<li>Small stuff is stuff we know will terminate right away.
</li>

<li>Don't sweat the small stuff if we know it will be evaluated.
</li>

<li>Don't sweat the small stuff if it <b>might</b> be evaluated, but instead pass it to k.
</li>
</ul>


<p>
A good example of the first is (null? ls) in the first cond line. We know it will be evaluated, and we know it's small stuff, so we don't have to worry about it. What about the '() that's returned as an answer? The other part of the second rule is that if some small stuff <b>might</b> be evaluated, we just pass it to k. After applying the second rule to the first cond line, we get:
</p>

<div class="org-src-container">

<pre class="src src-racket"><span style="color: #333333;">(</span><span style="color: #0000FF;">define</span> <span style="color: #BA36A5;">rember8</span>
  <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>ls k<span style="color: #333333;">)</span>
    <span style="color: #333333;">(</span><span style="color: #0000FF;">cond</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">null?</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k '<span style="color: #333333;">())]</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">=</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #2e8b57;">8</span><span style="color: #333333;">)</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)]</span>
      <span style="color: #333333;">[</span>else <span style="color: #333333;">(</span><span style="color: #006FE0;">cons</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>rember8 <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)))])))</span>
</pre>
</div>

<p>
The second cond line also has small stuff in both the test and the return value, so we can treat it just like the first line.
</p>

<div class="org-src-container">

<pre class="src src-racket"><span style="color: #333333;">(</span><span style="color: #0000FF;">define</span> <span style="color: #BA36A5;">rember8</span>
  <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>ls k<span style="color: #333333;">)</span>
    <span style="color: #333333;">(</span><span style="color: #0000FF;">cond</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">null?</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k '<span style="color: #333333;">())]</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">=</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #2e8b57;">8</span><span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">))]</span>
      <span style="color: #333333;">[</span>else <span style="color: #333333;">(</span><span style="color: #006FE0;">cons</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>rember8 <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)))])))</span>
</pre>
</div>

<p>
The else case, however, does <b>not</b> have small stuff as a return value, so we have to build a new continuation:
</p>

<div class="org-src-container">

<pre class="src src-racket"><span style="color: #333333;">(</span><span style="color: #0000FF;">define</span> <span style="color: #BA36A5;">rember8</span>
  <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>ls k<span style="color: #333333;">)</span>
    <span style="color: #333333;">(</span><span style="color: #0000FF;">cond</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">null?</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k '<span style="color: #333333;">())]</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">=</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #2e8b57;">8</span><span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">))]</span>
      <span style="color: #333333;">[</span>else <span style="color: #333333;">(</span>rember8 <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>x<span style="color: #333333;">)</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">cons</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> x<span style="color: #333333;">)))])))</span>
</pre>
</div>

<p>
We're not quite done, though, since we now have small stuff in the body of the continuation. So, we just pass it to k:
</p>

<div class="org-src-container">

<pre class="src src-racket"><span style="color: #333333;">(</span><span style="color: #0000FF;">define</span> <span style="color: #BA36A5;">rember8</span>
  <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>ls k<span style="color: #333333;">)</span>
    <span style="color: #333333;">(</span><span style="color: #0000FF;">cond</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">null?</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k '<span style="color: #333333;">())]</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">=</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #2e8b57;">8</span><span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">))]</span>
      <span style="color: #333333;">[</span>else <span style="color: #333333;">(</span>rember8 <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>x<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k <span style="color: #333333;">(</span><span style="color: #006FE0;">cons</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> x<span style="color: #333333;">))))])))</span>
</pre>
</div>

<p>
This is now completely CPSed, but how do we invoke it? After all, we need a k to pass in. Since (rember8 '() k) should be '(), k can be the identity function (lambda (x) x):
</p>

<div class="org-src-container">

<pre class="src src-racket"><span style="color: #006FE0;">&gt;</span> <span style="color: #333333;">(</span>rember8 '<span style="color: #333333;">(</span><span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">2</span> <span style="color: #2e8b57;">8</span> <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span> <span style="color: #2e8b57;">6</span> <span style="color: #2e8b57;">7</span> <span style="color: #2e8b57;">8</span> <span style="color: #2e8b57;">5</span><span style="color: #333333;">)</span> <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>x<span style="color: #333333;">)</span> x<span style="color: #333333;">))</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Property</h2>
<div class="outline-text-2" id="text-3">
<p>
What properties can we observe about this program?
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Tail calls</h3>
<div class="outline-text-3" id="text-3-1">
<p>
First, all non-small stuff calls are tail calls. Here's the program with the tail calls surrounded by asterisks:
</p>

<div class="org-src-container">

<pre class="src src-racket"><span style="color: #333333;">(</span><span style="color: #0000FF;">define</span> <span style="color: #BA36A5;">rember8</span>
  <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>ls k<span style="color: #333333;">)</span>
    <span style="color: #333333;">(</span><span style="color: #0000FF;">cond</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">null?</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>*k* '<span style="color: #333333;">())]</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">=</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #2e8b57;">8</span><span style="color: #333333;">)</span> <span style="color: #333333;">(</span>*k* <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">))]</span>
      <span style="color: #333333;">[</span>else <span style="color: #333333;">(</span>*rember8* <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>x<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>*k* <span style="color: #333333;">(</span><span style="color: #006FE0;">cons</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> x<span style="color: #333333;">))))])))</span>
</pre>
</div>

<p>
Why don't null?, =, car, cdr, and cons count? Because they're just small stuff, and when we combine small stuff together in small ways, the combination remains small.
</p>
</div>
</div>
