tspl/cps-notes.org
** Arguments

  Second, all arguments are small stuff. Yep, even the lambda in the else line, because lambda is *always* small stuff.

  Notice that this is essentially a C program. All we have to do is *_convert the continuations to data structures_* (remember how we did the same thing with closures).

  Let's trace (rember8  (lambda (x) x))

#+BEGIN_SRC racket

  ls                   | k

  '(1 2 8 3 4 6 7 8 5) | (lambda (x) x) = id
  '(2 8 3 4 6 7 8 5)   | (lambda (x) (id (cons 1 x))) = k2
  '(8 3 4 6 7 8 5)     | (lambda (x) (k2 (cons 2 x))) = k3

#+END_SRC

  Once we hit the 8, we apply /(k (cdr ls))/ where k is k3 and ls is '(8 3 4 6 7 8 5)

  (k3 '(3 4 6 7 8 5)) = (k2 (cons 2 '(3 4 6 7 8 5)))
  (k2 '(2 3 4 6 7 8 5)) = (id (cons 1 '(2 3 4 6 7 8 5)))
  (id '(1 2 3 4 6 7 8 5)) = '(1 2 3 4 6 7 8 5)

  And we're done.

* Demo

  Let's try a more complicated program, multirember8. Instead of just removing the first 8, it'll remove all of the 8s.

#+begin_src racket

(define multirember8
  (lambda (ls)
    (cond
      [(null? ls) '()]
      [(= (car ls) 8) (multirember8 (cdr ls))]
      [else (cons (car ls) (multirember8 (cdr ls)))])))

#+end_src

  Now, let's start CPSing by going back to our CPSed rember8:

#+begin_src racket

(define multirember8
  (lambda (ls k)
    (cond
      [(null? ls) (k '())]
      [(= (car ls) 8) (multirember8 (cdr ls))] ;; uh-oh!
      [else (multirember8 (cdr ls) (lambda (x) (k (cons (car ls) x))))])))

#+end_src

  What do we need to do for the second line? Since multirember8 takes two arguments, we need to now pass it a continuation.

#+begin_src racket

(define multirember8
  (lambda (ls k)
    (cond
      [(null? ls) (k '())]
      [(= (car ls) 8) (multirember8 (cdr ls) (lambda (x) (k x)))]
      [else (multirember8 (cdr ls) (lambda (x) (k (cons (car ls) x))))])))

#+end_src

  But what's (lambda (x) (k x)) doing? It's taking whatever is passed to it, and passing it to k. This whole expression, therefore, is equivalent to k.

  Eta reduction: (lambda (x) (M x)) = M, if x is not free in M and M is guaranteed to terminate. M is any arbitrary expression that satisfies these rules; it doesn't have to be only a single variable like k.

  So, whenever you see a tail call, you don't even have to think about eta. Just pass k to it.

#+begin_src racket

(define multirember8
  (lambda (ls k)
    (cond
      [(null? ls) (k '())]
      [(= (car ls) 8) (multirember8 (cdr ls) k)]
      [else (multirember8 (cdr ls) (lambda (x) (k (cons (car ls) x))))])))

#+end_src
