tspl/cps-notes.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Arguments</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Second, all arguments are small stuff. Yep, even the lambda in the else line, because lambda is <b>always</b> small stuff.
</p>

<p>
Notice that this is essentially a C program. All we have to do is <b><span class="underline">convert the continuations to data structures</span></b> (remember how we did the same thing with closures).
</p>

<p>
Let's trace (rember8  (lambda (x) x))
</p>

<div class="org-src-container">

<pre class="src src-racket">ls                   | k

'<span style="color: #333333;">(</span><span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">2</span> <span style="color: #2e8b57;">8</span> <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span> <span style="color: #2e8b57;">6</span> <span style="color: #2e8b57;">7</span> <span style="color: #2e8b57;">8</span> <span style="color: #2e8b57;">5</span><span style="color: #333333;">)</span> | <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>x<span style="color: #333333;">)</span> x<span style="color: #333333;">)</span> <span style="color: #006FE0;">=</span> id
'<span style="color: #333333;">(</span><span style="color: #2e8b57;">2</span> <span style="color: #2e8b57;">8</span> <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span> <span style="color: #2e8b57;">6</span> <span style="color: #2e8b57;">7</span> <span style="color: #2e8b57;">8</span> <span style="color: #2e8b57;">5</span><span style="color: #333333;">)</span>   | <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>x<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>id <span style="color: #333333;">(</span><span style="color: #006FE0;">cons</span> <span style="color: #2e8b57;">1</span> x<span style="color: #333333;">)))</span> <span style="color: #006FE0;">=</span> k2
'<span style="color: #333333;">(</span><span style="color: #2e8b57;">8</span> <span style="color: #2e8b57;">3</span> <span style="color: #2e8b57;">4</span> <span style="color: #2e8b57;">6</span> <span style="color: #2e8b57;">7</span> <span style="color: #2e8b57;">8</span> <span style="color: #2e8b57;">5</span><span style="color: #333333;">)</span>     | <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>x<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k2 <span style="color: #333333;">(</span><span style="color: #006FE0;">cons</span> <span style="color: #2e8b57;">2</span> x<span style="color: #333333;">)))</span> <span style="color: #006FE0;">=</span> k3
</pre>
</div>

<p>
Once we hit the 8, we apply <i>(k (cdr ls))</i> where k is k3 and ls is '(8 3 4 6 7 8 5)
</p>

<p>
(k3 '(3 4 6 7 8 5)) = (k2 (cons 2 '(3 4 6 7 8 5)))
(k2 '(2 3 4 6 7 8 5)) = (id (cons 1 '(2 3 4 6 7 8 5)))
(id '(1 2 3 4 6 7 8 5)) = '(1 2 3 4 6 7 8 5)
</p>

<p>
And we're done.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Demo</h2>
<div class="outline-text-2" id="text-4">
<p>
Let's try a more complicated program, multirember8. Instead of just removing the first 8, it'll remove all of the 8s.
</p>

<div class="org-src-container">

<pre class="src src-racket"><span style="color: #333333;">(</span><span style="color: #0000FF;">define</span> <span style="color: #BA36A5;">multirember8</span>
  <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>ls<span style="color: #333333;">)</span>
    <span style="color: #333333;">(</span><span style="color: #0000FF;">cond</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">null?</span> ls<span style="color: #333333;">)</span> '<span style="color: #333333;">()]</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">=</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #2e8b57;">8</span><span style="color: #333333;">)</span> <span style="color: #333333;">(</span>multirember8 <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">))]</span>
      <span style="color: #333333;">[</span>else <span style="color: #333333;">(</span><span style="color: #006FE0;">cons</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>multirember8 <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)))])))</span>
</pre>
</div>

<p>
Now, let's start CPSing by going back to our CPSed rember8:
</p>

<div class="org-src-container">

<pre class="src src-racket"><span style="color: #333333;">(</span><span style="color: #0000FF;">define</span> <span style="color: #BA36A5;">multirember8</span>
  <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>ls k<span style="color: #333333;">)</span>
    <span style="color: #333333;">(</span><span style="color: #0000FF;">cond</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">null?</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k '<span style="color: #333333;">())]</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">=</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #2e8b57;">8</span><span style="color: #333333;">)</span> <span style="color: #333333;">(</span>multirember8 <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">))]</span> <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">uh-oh!</span>
      <span style="color: #333333;">[</span>else <span style="color: #333333;">(</span>multirember8 <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>x<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k <span style="color: #333333;">(</span><span style="color: #006FE0;">cons</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> x<span style="color: #333333;">))))])))</span>
</pre>
</div>

<p>
What do we need to do for the second line? Since multirember8 takes two arguments, we need to now pass it a continuation.
</p>

<div class="org-src-container">

<pre class="src src-racket"><span style="color: #333333;">(</span><span style="color: #0000FF;">define</span> <span style="color: #BA36A5;">multirember8</span>
  <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>ls k<span style="color: #333333;">)</span>
    <span style="color: #333333;">(</span><span style="color: #0000FF;">cond</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">null?</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k '<span style="color: #333333;">())]</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">=</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #2e8b57;">8</span><span style="color: #333333;">)</span> <span style="color: #333333;">(</span>multirember8 <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>x<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k x<span style="color: #333333;">)))]</span>
      <span style="color: #333333;">[</span>else <span style="color: #333333;">(</span>multirember8 <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>x<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k <span style="color: #333333;">(</span><span style="color: #006FE0;">cons</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> x<span style="color: #333333;">))))])))</span>
</pre>
</div>

<p>
But what's (lambda (x) (k x)) doing? It's taking whatever is passed to it, and passing it to k. This whole expression, therefore, is equivalent to k.
</p>

<p>
Eta reduction: (lambda (x) (M x)) = M if x is not free in M and M is guaranteed to terminate. M is any arbitrary expression that satisfies these rules; it doesn't have to be only a single variable like k.
</p>

<p>
So, whenever you see a tail call, you don't even have to think about eta. Just pass k to it.
</p>

<div class="org-src-container">

<pre class="src src-racket"><span style="color: #333333;">(</span><span style="color: #0000FF;">define</span> <span style="color: #BA36A5;">multirember8</span>
  <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>ls k<span style="color: #333333;">)</span>
    <span style="color: #333333;">(</span><span style="color: #0000FF;">cond</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">null?</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k '<span style="color: #333333;">())]</span>
      <span style="color: #333333;">[(</span><span style="color: #006FE0;">=</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> <span style="color: #2e8b57;">8</span><span style="color: #333333;">)</span> <span style="color: #333333;">(</span>multirember8 <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)</span> k<span style="color: #333333;">)]</span>
      <span style="color: #333333;">[</span>else <span style="color: #333333;">(</span>multirember8 <span style="color: #333333;">(</span><span style="color: #006FE0;">cdr</span> ls<span style="color: #333333;">)</span> <span style="color: #333333;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #333333;">(</span>x<span style="color: #333333;">)</span> <span style="color: #333333;">(</span>k <span style="color: #333333;">(</span><span style="color: #006FE0;">cons</span> <span style="color: #333333;">(</span><span style="color: #006FE0;">car</span> ls<span style="color: #333333;">)</span> x<span style="color: #333333;">))))])))</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Indiana course</p>
<p class="date">Created: 2015-07-19 Sun 16:55</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"></p>
</div>
</body>
</html>
